In [2]:
import numpy as np
import pandas as pd

In [3]:
wine = pd.read_csv('./data/wine.csv', header=None)
wine.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6497 entries, 0 to 6496
Data columns (total 13 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       6497 non-null   float64
 1   1       6497 non-null   float64
 2   2       6497 non-null   float64
 3   3       6497 non-null   float64
 4   4       6497 non-null   float64
 5   5       6497 non-null   float64
 6   6       6497 non-null   float64
 7   7       6497 non-null   float64
 8   8       6497 non-null   float64
 9   9       6497 non-null   float64
 10  10      6497 non-null   float64
 11  11      6497 non-null   int64
 12  12      6497 non-null   int64
dtypes: float64(11), int64(2)
memory usage: 660.0 KB

In [4]:
wine.head(5)

,0,1,2,3,4,5,6,7,8,9,10,11,12
0,6.7,0.675,0.07,2.4,0.089,17.0,82.0,0.9958,3.35,0.54,10.1,5,1
1,6.9,0.685,0.00,2.5,0.105,22.0,37.0,0.9966,3.46,0.57,10.6,6,1
2,8.3,0.655,0.12,2.3,0.083,15.0,113.0,0.9966,3.17,0.66,9.8,5,1
3,6.9,0.605,0.12,10.7,0.073,40.0,83.0,0.9993,3.45,0.52,9.4,6,1
4,5.2,0.320,0.25,1.8,0.103,13.0,50.0,0.9957,3.38,0.55,9.2,5,1

In [5]:
wine5 = wine.head()
wine5.to_csv('./data/wine5.csv', index=False, header=None)

In [6]:
# sample_1.xlsx 엑셀데이터 불러오기
# header=1: 컬럼명 1행, 0부터 시작
# skipfooter=2: 마지막 2행 제외 
# usecols='A:C': 사용할 컬럼명
df = pd.read_excel('./data/sample1.xlsx', 
                    header=1, 
                    skipfooter=2, 
                    usecols='A:C')
print(type(df))
df.head(3)

<class 'pandas.core.frame.DataFrame'>

  국적코드  성별    입국객수
0  A01  남성  106320
1  A01  여성  191436
2  A31  남성     319

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   국적코드    6 non-null      object
 1   성별      6 non-null      object
 2   입국객수    6 non-null      int64
dtypes: int64(1), object(2)
memory usage: 272.0+ bytes

In [8]:
df

  국적코드  성별    입국객수
0  A01  남성  106320
1  A01  여성  191436
2  A31  남성     319
3  A31  여성      42
4  A18  남성  158912
5  A18  여성  232943

In [10]:
print(df['국적코드'])
print(type(df['국적코드']))

0    A01
1    A01
2    A31
3    A31
4    A18
5    A18
Name: 국적코드, dtype: object
<class 'pandas.core.series.Series'>

In [11]:
df[['국적코드','입국객수']]

  국적코드    입국객수
0  A01  106320
1  A01  191436
2  A31     319
3  A31      42
4  A18  158912
5  A18  232943

In [12]:
df['기준년월'] = '2021-06'
df

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2021-06
1  A01  여성  191436  2021-06
2  A31  남성     319  2021-06
3  A31  여성      42  2021-06
4  A18  남성  158912  2021-06
5  A18  여성  232943  2021-06

In [14]:
condition =df['성별'] == '남성'
print(condition)
print(type(condition))

0     True
1    False
2     True
3    False
4     True
5    False
Name: 성별, dtype: bool
<class 'pandas.core.series.Series'>

In [15]:
df[condition]

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2021-06
2  A31  남성     319  2021-06
4  A18  남성  158912  2021-06

In [17]:
condition =df['입국객수'] >= 150000
print(condition)
print(type(condition))

0    False
1     True
2    False
3    False
4     True
5     True
Name: 입국객수, dtype: bool
<class 'pandas.core.series.Series'>

In [18]:
df[condition]

  국적코드  성별    입국객수     기준년월
1  A01  여성  191436  2021-06
4  A18  남성  158912  2021-06
5  A18  여성  232943  2021-06